// 기관 코드에 따른 텍스트 매핑
const agencyCodes = {
    'hometax': '[홈택스]',
    'wetax': '[위택스]',
    'edi.kcomwel': '[고용산재]'
};

// 세무 코드에 따른 텍스트 매핑
const taxCodes = {
    '14': ' 원천세',
    '41': ' 부가세',
    '31': ' 법인세',
    '10': ' 종합소득세',
    '47': ' 개별소비세',
    '22': ' 양도소득세'
};

// 서비스 코드에 따른 텍스트 매핑
const serviceCodes = {
    'P5001': item => item['구분'] === 'PDF' ? '신고자료' : '신고내역',
    'Z1001': ' 수임고객정보',
    'P0001': ' 특별징수내역',
    'E0010': '[건강보험] 사업장리스트조회',
    'E0001': '[건강보험] 개인별고지내역',
    'E0011': '[건강보험] 사업장고지내역 합계',
    'E0020': '[국민연금] 사업장리스트조회',
    'E0002': '[국민연금] 개인별결정내역통보서',
    'E0021': '[국민연금] 소급분내역',
    'E0022': '[국민연금] 보험료내역',
    'B1022': '민원증명',
    'B0005': '민원증명',
    'B4009': '민원증명',
    'B1002': '민원증명',
    'B1003': '민원증명',
    'B0006': '민원증명',
    'B0001': '민원증명'
};

const insureCodes = {
    'nhic': '건강보험',
    'nps': '국민연금',
    'kcomwel': '고용산재',
};